x = sym('x', [1,14]); % 生成 x1, x2, ..., x14
S = sym('S', [1,7]); % 生成 S1, S2, ..., S7

% D-H参数矩阵提取出R
R01=[cos(x(1)) -sin(x(1)) 0;0 0 -1;sin(x(1)) cos(x(1)) 0];
R12=[cos(x(2)) -sin(x(2)) 0;0 0 -1;sin(x(2)) cos(x(2)) 0];
R23=[cos(x(3)) -sin(x(3)) 0;0 0 1;-sin(x(3)) -cos(x(3)) 0];
R34=[cos(x(4)) -sin(x(4)) 0;sin(x(4)) cos(x(4)) 0;0 0 1];
R45=[cos(x(5)) -sin(x(5)) 0;sin(x(5)) cos(x(5)) 0;0 0 1];
R56=[cos(x(6)) -sin(x(6)) 0;0 0 -1;sin(x(6)) cos(x(6)) 0];
R67=[cos(x(7)) -sin(x(7)) 0;0 0 1;-sin(x(7)) -cos(x(7)) 0];

% 转置R
R10=R01';
R21=R12';
R32=R23';
R43=R34';
R54=R45';
R65=R56';
R76=R67';

% D-H参数矩阵提取出P 
P01=[0;-0.225;0];
P12=[0;-0.24;0];
P23=[0;0.24;0];
P34=[0.56;0;0.2];
P45=[0.5;0;0.195];
P56=[0;-0.18;0];
P67=[0;0.476;0];

% 质心坐标
PC1=[0.003;-0.067;-0.052];
PC2=[0.001;0.06;-0.058];
PC3=[0.226;0.005;-0.025];
PC4=[0.238;0.001;-0.001];
PC5=[0.008;-0.028;-0.031];
PC6=[-0.025;0.023;0.003];
PC7=[0.003;-0.010;-0.199];

% IC：惯性张量矩阵
IC1=[ 0.0980 -0.0050 -0.0030; -0.0050 0.0450 0.0220; -0.0030 0.0220 0.0720];
IC2=[ 0.0870 -0.0050 -0.0020; -0.0050 0.0210 -0.0220; -0.0020 -0.0220 0.0690];
IC3=[ 0.0790 -0.0020 -0.1200; -0.0020 0.5710 -0.0890; -0.1200 -0.0890 0.5300];
IC4=[ 0.0320 -0.0010 -0.0520; -0.0010 0.3250 -0.0920; -0.0520 -0.0920 0.3130];
IC5=[ 0.0140 -0.0110 -0.0010; -0.0110 0.0100 0.0020; -0.0010 0.0020 0.0110];
IC6=[ 0.0130 -0.0020 -0.0010; -0.0020 0.0090 -0.0010; -0.0010 -0.0010 0.0110];
IC7=[ 0.1510 -0.0020 -0.0030; -0.0020 0.1950 -0.0080; -0.0030 -0.0080 0.0960];


g=9.8;
W00=[0;0;0];
W_d00=[0;0;0];
V_d00=[0;g;0];
VC_d00=[0;0;0];
Z=[0;0;1];
% 外推法：从连杆1到7向外递推计算连杆的速度和加速度
% 关节1相对于基座0
W11=R10*W00+x(8)*Z;
W_d11=R10*W_d00+cross((R10*W00),(x(8)*Z))+S(1)*Z;
V_d11=R10*(cross(W_d00,P01)+cross(W00,cross(W00,P01))+V_d00);
VC_d11=cross(W_d11,PC1)+cross(W11,(cross(W11,PC1)))+V_d11;
F11=6.34*VC_d11;
N11=IC1*W_d11+cross(W11,IC1*W11);
% 关节2相对于关节1
W22 = R21 * W11 + x(9) * Z;
W_d22 = R21 * W_d11 + cross(R21 * W11, x(9) * Z) + S(2) * Z;
V_d22 = R21 * (cross(W_d11, P12) + cross(W11, cross(W11, P12)) + V_d11);
VC_d22 = cross(W_d22, PC2) + cross(W22, cross(W22, PC2)) + V_d22;
F22 = 6.32 * VC_d22;
N22 = IC2 * W_d22 + cross(W22, IC2 * W22);
% 关节3相对于关节2
W33 = R32 * W22 + x(10) * Z;
W_d33 = R32 * W_d22 + cross(R32 * W22, x(10) * Z) + S(3) * Z;
V_d33 = R32 * (cross(W_d22, P23) + cross(W22, cross(W22, P23)) + V_d22);
VC_d33 = cross(W_d33, PC3) + cross(W33, cross(W33, PC3)) + V_d33;
F33 = 7.93 * VC_d33;
N33 = IC3 * W_d33 + cross(W33, IC3 * W33);
% 关节4相对于关节3
W44 = R43 * W33 + x(11) * Z;
W_d44 = R43 * W_d33 + cross(R43 * W33, x(11) * Z) + S(4) * Z;
V_d44 = R43 * (cross(W_d33, P34) + cross(W33, cross(W33, P34)) + V_d33);
VC_d44 = cross(W_d44, PC4) + cross(W44, cross(W44, PC4)) + V_d44;
F44 = 5.67 * VC_d44;
N44 = IC4 * W_d44 + cross(W44, IC4 * W44);
% 关节5相对于关节4
W55 = R54 * W44 + x(12) * Z;
W_d55 = R54 * W_d44 + cross(R54 * W44, x(12) * Z) + S(5) * Z;
V_d55 = R54 * (cross(W_d44, P45) + cross(W44, cross(W44, P45)) + V_d44);
VC_d55 = cross(W_d55, PC5) + cross(W55, cross(W55, PC5)) + V_d55;
F55 = 2.84 * VC_d55;
N55 = IC5 * W_d55 + cross(W55, IC5 * W55);
% 关节6相对于关节5
W66 = R65 * W55 + x(13) * Z;
W_d66 = R65 * W_d55 + cross(R65 * W55, x(13) * Z) + S(6) * Z;
V_d66 = R65 * (cross(W_d55, P56) + cross(W55, cross(W55, P56)) + V_d55);
VC_d66 = cross(W_d66, PC6) + cross(W66, cross(W66, PC6)) + V_d66;
F66 = 2.71 * VC_d66;
N66 = IC6 * W_d66 + cross(W66, IC6 * W66);
% 关节7相对于关节6
W77 = R76 * W66 + x(14) * Z;
W_d77 = R76 * W_d66 + cross(R76 * W66, x(14) * Z) + S(7) * Z;
V_d77 = R76 * (cross(W_d66, P67) + cross(W66, cross(W66, P67)) + V_d66);
VC_d77 = cross(W_d77, PC7) + cross(W77, cross(W77, PC7)) + V_d77;
F77 = 12.08 * VC_d77;
N77 = IC7 * W_d77 + cross(W77, IC7 * W77);

% 内推法：从连杆7到1迭代计算连杆间相互作用力力矩以及关节驱动力矩
% 连杆间相互作用力
f7=F77; 
f6=R67*f7+F66;
f5=R56*f6+F55;
f4=R45*f5+F44;
f3=R34*f4+F33;
f2=R23*f3+F22;
f1=R12*f2+F11;

% 连杆间相互作用力矩
n7=N77+cross(PC7,F77); 
n6=N66+R67*n7+cross(PC6,F66)+cross(P67,R67*f7);
n5=N55+R56*n6+cross(PC5,F55)+cross(P56,R56*f6);
n4=N44+R45*n5+cross(PC4,F44)+cross(P45,R45*f5);
n3=N33+R34*n4+cross(PC3,F33)+cross(P34,R34*f4);
n2=N22+R23*n3+cross(PC2,F22)+cross(P23,R23*f3);
n1=N11+R12*n2+cross(PC1,F11)+cross(P12,R12*f2);

% 关节力矩
t1=n1'*Z;
t2=n2'*Z;
t3=n3'*Z;
t4=n4'*Z;
t5=n5'*Z;
t6=n6'*Z;
t7=n7'*Z;

tau1 = [t1; t2; t3; t4; t5; t6; t7];
tau2 = tau1;
tau3 = tau1;

global C MT
% 替换符号变量为数值
G = subs(tau1, [S(1:7), x(8:14)], [zeros(1,7), zeros(1,7)]);

o1=[1,0,0,0,0,0,0];
o2=[0,1,0,0,0,0,0];
o3=[0,0,1,0,0,0,0];
o4=[0,0,0,1,0,0,0];
o5=[0,0,0,0,1,0,0];
o6=[0,0,0,0,0,1,0];
o7=[0,0,0,0,0,0,1];

tau2=tau2-G;
M1 = subs(tau2, [S(1:7), x(8:14)], [o1, zeros(1,7)]);
M2 = subs(tau2, [S(1:7), x(8:14)], [o2, zeros(1,7)]);
M3 = subs(tau2, [S(1:7), x(8:14)], [o3, zeros(1,7)]);
M4 = subs(tau2, [S(1:7), x(8:14)], [o4, zeros(1,7)]);
M5 = subs(tau2, [S(1:7), x(8:14)], [o5, zeros(1,7)]);
M6 = subs(tau2, [S(1:7), x(8:14)], [o6, zeros(1,7)]);
M7 = subs(tau2, [S(1:7), x(8:14)], [o7, zeros(1,7)]);

M=[M1,M2,M3,M4,M5,M6,M7];

C_dev = subs(tau3, S(1:7), zeros(1,7));
C = C_dev - G ;











